#include "api.h"
#include "cc.h"
#include "perf.h"
#include "sys_arch.h"
#include "sys.h"



static void *ArrayOfMsg[MAX_QUEUE_ENTRIES];

OS_STK LWIP_THREAD_TASK[LWIP_THREAD_TASK_MAX][LWIP_THREAD_TASK_STACK];
u8_t cur_prio = 0;
/***************************************************************************************************************************
**函数名称:	 	sys_init
**函数功能:	 	
**入口参数:
**返回参数:
***************************************************************************************************************************/
void sys_init(void)
{
	cur_prio = LWIP_THREAD_TASK_PRIO_MIN;
}
/***************************************************************************************************************************
**函数名称:	 	sys_sem_new
**函数功能:	 	
**入口参数:
**返回参数:
***************************************************************************************************************************/
err_t sys_sem_new(sys_sem_t *sem, u8_t count)
{
	err_t Res = ERR_VAL;
	sem = NULL;
	sem = OSSemCreate(count);
	if(NULL != sem)
	{
		Res = ERR_OK;
	}
	return Res;
}
/***************************************************************************************************************************
**函数名称:	 	sys_sem_free
**函数功能:	 	
**入口参数:
**返回参数:
***************************************************************************************************************************/
void sys_sem_free(sys_sem_t *sem)
{
	INT8U Res;
	OSSemDel(sem,OS_DEL_NO_PEND,&Res);
}
/***************************************************************************************************************************
**函数名称:	 	sys_sem_signal
**函数功能:	 	
**入口参数:
**返回参数:
***************************************************************************************************************************/
void sys_sem_signal(sys_sem_t *sem)
{
	if(NULL != sem)
	{
		OSSemPost(sem);
	}
}
/***************************************************************************************************************************
**函数名称:	 	sys_arch_sem_wait
**函数功能:	 	
**入口参数:
**返回参数:
***************************************************************************************************************************/
u32_t sys_arch_sem_wait(sys_sem_t *sem, u32_t timeout)
{
	INT8U err;
	OSSemPend(sem,timeout,&err);
	return err;
}
/***************************************************************************************************************************
**函数名称:	 	sys_sem_valid
**函数功能:	 	
**入口参数:
**返回参数:
***************************************************************************************************************************/
int sys_sem_valid(sys_sem_t *sem)
{
	int Res = 0;
	if(NULL != sem)
	{
		Res = 1;
	}
	return Res;
}
/***************************************************************************************************************************
**函数名称:	 	sys_sem_set_invalid
**函数功能:	 	调用此函数前要调用sys_sem_free函数
**入口参数:
**返回参数:
***************************************************************************************************************************/
void sys_sem_set_invalid(sys_sem_t *sem)
{
	sem = NULL;
}
/***************************************************************************************************************************
**函数名称:	 	sys_mbox_new
**函数功能:	 	
**入口参数:
**返回参数:
***************************************************************************************************************************/
err_t sys_mbox_new(sys_mbox_t *mbox, int size)
{
	err_t err = ERR_VAL;
	mbox = NULL;
	mbox = OSQCreate(&ArrayOfMsg[0],size);
	if(NULL != err)
	{
		err = ERR_OK;
	}
	return err;
}
/***************************************************************************************************************************
**函数名称:	 	sys_mbox_free
**函数功能:	 	
**入口参数:
**返回参数:
***************************************************************************************************************************/
void sys_mbox_free(sys_mbox_t *mbox)
{
	INT8U err;
	OSQDel(mbox,OS_DEL_NO_PEND,&err);
}
/***************************************************************************************************************************
**函数名称:	 	sys_mbox_post
**函数功能:	 	
**入口参数:
**返回参数:
***************************************************************************************************************************/
void sys_mbox_post(sys_mbox_t *mbox, void *msg)
{
	if(NULL != msg)
	{
		OSQPost(mbox,msg);
	}
}
/***************************************************************************************************************************
**函数名称:	 	sys_mbox_trypost
**函数功能:	 	
**入口参数:
**返回参数:
***************************************************************************************************************************/
err_t sys_mbox_trypost(sys_mbox_t *mbox, void *msg)
{
	err_t err = ERR_OK;

	if(NULL != msg)
	{
		err = OSMboxPost(mbox,msg);
		if(OS_NO_ERR != err)
		{
			err = ERR_MEM;
		}
	}
	return err;
}
/***************************************************************************************************************************
**函数名称:	 	sys_arch_mbox_fetch
**函数功能:	 	
**入口参数:
**返回参数:
***************************************************************************************************************************/
u32_t sys_arch_mbox_fetch(sys_mbox_t *mbox, void **msg, u32_t timeout)
{
	INT8U err;
	u32_t ucos_timeout,timeout_new;
	void *temp = NULL;
	
	if(timeout != 0)
	{
		ucos_timeout = (timeout * OS_TICKS_PER_SEC) / 1000;
		if(ucos_timeout <= 1)
		{
			ucos_timeout = 1;
		}
	}
	else
	{
		ucos_timeout = 0;
	}
	
	timeout = OSTimeGet();
	temp = OSQPend(mbox,(u16_t)ucos_timeout,&err);
	if(msg != NULL)
	{
		*msg = temp;
	}
	
	if(OS_TIMEOUT == err)
	{
		timeout = SYS_ARCH_TIMEOUT;
	}
	else
	{
		timeout_new = OSTimeGet();
		if(timeout_new > timeout )
		{
			timeout_new = timeout_new - timeout;
		}
		else
		{
			timeout_new = 0XFFFFFFFF - timeout + timeout_new;
		}
		timeout = timeout_new * 1000 / OS_TICKS_PER_SEC + 1;
	}
	return timeout;
}	
/***************************************************************************************************************************
**函数名称:	 	sys_mbox_valid
**函数功能:	 	
**入口参数:
**返回参数:
***************************************************************************************************************************/
int sys_mbox_valid(sys_mbox_t *mbox)
{
	int err = 0;
	if(NULL != mbox)
	{
		err = 1;
	}
	return err;
}
/***************************************************************************************************************************
**函数名称:	 	sys_mbox_set_invalid
**函数功能:	 	该函数调用前要先调用sys_mbox_free
**入口参数:
**返回参数:
***************************************************************************************************************************/
void sys_mbox_set_invalid(sys_mbox_t *mbox)
{
	mbox = NULL;
}
/***************************************************************************************************************************
**函数名称:	 	sys_thread_new
**函数功能:	 	
**入口参数:
**返回参数:
***************************************************************************************************************************/
sys_thread_t sys_thread_new(const char *name, lwip_thread_fn thread, void *arg, int stacksize, int prio)
{
	sys_thread_t err;
	u8_t tmp;
	cur_prio += prio;
	tmp = cur_prio - LWIP_THREAD_TASK_PRIO_MIN;
	printf("\r\n thread name %s prio %d cur_prio %d ",name,prio,cur_prio);
	if(cur_prio <= LWIP_THREAD_TASK_PRIO_MAX)
	{
		err = OSTaskCreate(thread,&arg,LWIP_THREAD_TASK[tmp],cur_prio);
	}
	return cur_prio;
}
/***************************************************************************************************************************
**函数名称:	 	sys_arch_protect
**函数功能:	 	
**入口参数:
**返回参数:
***************************************************************************************************************************/
sys_prot_t sys_arch_protect(void)
{
	OS_ENTER_CRITICAL();
	return 0;
}
/***************************************************************************************************************************
**函数名称:	 	sys_arch_unprotect
**函数功能:	 	
**入口参数:
**返回参数:
***************************************************************************************************************************/
void sys_arch_unprotect(sys_prot_t pval)
{
	OS_EXIT_CRITICAL();
}
/***************************************************************************************************************************
**函数名称:	 	sys_now
**函数功能:	 	
**入口参数:
**返回参数:
***************************************************************************************************************************/
u32_t sys_now(void)
{
	return OSTimeGet();
}



